tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

#dev
#brew "node"        # Estoy usando nvm de momento, hay problemas de nvm con homebrew por eso hago la instalacion directa.
brew "smartmontools"  # para verificar el estado de los discos
cask "iterm2"         # Terminal emulator as alternative to Apple's Terminal app
cask "runjs"          # JavaScript playground that auto-evaluates as code is typed
cask "postman"        # Collaboration platform for API development
cask "visual-studio-code"

#fun
cask "spotify"
cask "discord"

#tools
cask "fig"            # Tools for terminal
cask "aldente"        # Menu bar tool to limit maximum charging percentage
cask "keka"           # File archiver
cask "rectangle"      # Move and resize windows using keyboard shortcuts or snap areas
cask "stats"          # System monitor for the menu bar
cask "obsidian"       # Knowledge base that works on top of a local folder of plain text Markdown files
cask "microsoft-edge"
cask "firefox"
#cask "webex-meetings" #Depende si aun lo uso
